In [6]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelEncoder
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split
from sklearn.model_selection import cross_val_score
from sklearn.model_selection import KFold

In [28]:
titanic_df = pd.read_csv('train.csv')
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [31]:
titanic_df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Cabin  Embarked
0         0       3    1  22.0      1      0   7.2500    146         3
1         1       1    0  38.0      1      0  71.2833     81         0
2         1       3    0  26.0      0      0   7.9250    146         3
3         1       1    0  35.0      1      0  53.1000     55         3
4         0       3    1  35.0      0      0   8.0500    146         3

In [24]:
def func_fillna(df):
    df['Age'].fillna(df['Age'].mean(), inplace = True)
    df['Cabin'].fillna('N', inplace = True)
    df['Embarked'].fillna('N', inplace = True)
    return df

def func_drop(df):
    df.drop(['PassengerId','Name','Ticket'], axis = 1, inplace = True)
    return df

def label_encoding(df):
    df['Cabin'].str[:1]
    LE = LabelEncoder()
    features = ['Sex','Cabin','Embarked']
    for feature in features:
        LE.fit(df[feature])
        df[feature] = LE.transform(df[feature])
    return df

def TransformFeatures(df):
    df = func_fillna(df)
    df = func_drop(df)
    df = label_encoding(df)
    return df

In [29]:
titanic_df.columns.values.tolist()
df = TransformFeatures(titanic_df)

In [32]:
df_data = df.drop(['Survived'], axis = 1, inplace = False)
df_label = df['Survived']

In [34]:
X_train, X_test, y_train, y_test = train_test_split(df_data, df_label, test_size = 0.2)

In [38]:
tree_clf = DecisionTreeClassifier()
pred = cross_val_score(tree_clf, X_train, y_train, scoring = 'accuracy', cv = 3 )
pred.mean()

0.7457185405807892

In [7]:
from sklearn.datasets import load_iris
iris = load_iris()
iris_data = iris.data # ndarray인것 잊지말기
iris_label = iris.target
iris_df = pd.DataFrame(iris_data, columns = iris.feature_names)

In [8]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()#전체를 정규화 하는게 아니라 dp[[columns]]이래야 df고 처리됨
scaler.fit(iris_df[['sepal length (cm)','sepal width (cm)']])
iris_scaled = scaler.transform(iris_df[['sepal length (cm)','sepal width (cm)']])
iris_df_scaled = pd.DataFrame(iris_scaled, columns = ['sepal length (cm)','sepal width (cm)'])

In [22]:
iris_df['sepal length (cm)'] = iris_df_scaled['sepal length (cm)']
iris_df

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0            -0.900681               3.5                1.4               0.2
1            -1.143017               3.0                1.4               0.2
2            -1.385353               3.2                1.3               0.2
3            -1.506521               3.1                1.5               0.2
4            -1.021849               3.6                1.4               0.2
..                 ...               ...                ...               ...
145           1.038005               3.0                5.2               2.3
146           0.553333               2.5                5.0               1.9
147           0.795669               3.0                5.2               2.0
148           0.432165               3.4                5.4               2.3
149           0.068662               3.0                5.1               1.8

[150 rows x 4 columns]

In [50]:
iris_df.columns.values.tolist()

['sepal length (cm)',
 'sepal width (cm)',
 'petal length (cm)',
 'petal width (cm)']

In [61]:
#리스트 컴프리헨션과 *을 이용해서 0으로 이루어진 (2,3) list를 만들자
m=3
n=2
[[0]*m for _ in range(n)]

[[0, 0, 0], [0, 0, 0]]

In [63]:
#리스트 컴프리헨션으로 0부터 19까지 홀수만 포함하기
[i for i in range(20) if i % 2 ==1 ]

[1, 3, 5, 7, 9, 11, 13, 15, 17, 19]

In [65]:
#a = [1,2,3,4,5,5,5]이고 remove_set = [3,5] 일때 리스트 컴프리헨션으로 remove_set을 a에서 삭제하기
a = [1,2,3,4,5,5,5]
remove_set = [3,5]
[i for i in a if i not in remove_set]

[1, 2, 4]

In [66]:
a = {1,2,3,4,3,4,5}
a

{1, 2, 3, 4, 5}